{
  "title": "AppML History",
  "url": "https://www.w3schools.com/appml/appml_history.asp",
  "metadata": {
    "viewport": "width=device-width, initial-scale=1",
    "title": "W3Schools.com",
    "Keywords": "HTML, Python, CSS, SQL, JavaScript, How to, PHP, Java, C, C++, C#, jQuery, Bootstrap, Colors, W3.CSS, XML, MySQL, Icons, NodeJS, React, Graphics, Angular, R, AI, Git, Data Science, Code Game, Tutorials, Programming, Web Development, Training, Learning, Quiz, Exercises, Courses, Lessons, References, Examples, Learn to code, Source code, Demos, Tips, Website",
    "Description": "Well organized and easy to understand Web building tutorials with lots of examples of how to use HTML, CSS, JavaScript, SQL, Python, PHP, Bootstrap, Java, XML and more.",
    "og:image": "https://www.w3schools.com/images/w3schools_logo_436_2.png",
    "og:image:type": "image/png",
    "og:image:width": "436",
    "og:image:height": "228",
    "og:description": "W3Schools offers free online tutorials, references and exercises in all the major languages of the web. Covering popular subjects like HTML, CSS, JavaScript, Python, SQL, Java, and many, many more.",
    "msapplication-TileColor": "#00a300",
    "theme-color": "#ffffff",
    "keywords": "HTML, Python, CSS, SQL, JavaScript, How to, PHP, Java, C, C++, C#, jQuery, Bootstrap, Colors, W3.CSS, XML, MySQL, Icons, NodeJS, React, Graphics, Angular, R, AI, Git, Data Science, Code Game, Tutorials, Programming, Web Development, Training, Learning, Quiz, Exercises, Courses, Lessons, References, Examples, Learn to code, Source code, Demos, Tips, Website"
  },
  "content": [
    {
      "type": "header",
      "metadata": {
        "level": "h1"
      },
      "text": "AppML History",
      "level": "h1"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "In 1999 Refsnes Data developed the first version of AppML.",
      "html": "<p>In 1999 Refsnes Data developed the first version of AppML.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Already then, AppML was based on HTTP request communication between web client and the web server. Later this method became well known as AJAX.",
      "html": "<p>Already then,  AppML was based on HTTP request communication \nbetween web client and the web server. Later this method became well known as \nAJAX.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "In September 2000, a development project for a large Norwegian customer was started. The goal of the project was to convert a huge information system (about 300 applications) from a Windows desktop application to a modern Internet application, using only AppML.",
      "html": "<p>\nIn September 2000, a development project for a large Norwegian customer was \nstarted. The goal of the project was to convert a huge information system (about \n300 applications) from a Windows desktop application to a modern Internet \napplication, using only AppML.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "The AppML-based system was launched in 2001, several months before schedule, as the world's first commercial AJAX application. The project was a huge success, with development time reduced by 75% compared to ordinary web development. Since then, new applications have been added, and the system now covers over 1000 running applications.",
      "html": "<p>The AppML-based system was launched in 2001, \nseveral months before schedule, as the world's first commercial AJAX \napplication. The project was a huge success, with development time reduced by \n75% compared to ordinary web development. Since then, new \napplications have been added, and the system now covers over 1000 running \napplications.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "In February 2015, W3Schools re-launched AppML as a new product, open to the public.",
      "html": "<p>In February 2015, W3Schools re-launched AppML as a new product, open to the \npublic.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "AppML design goals:",
      "html": "<p>AppML design goals:</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "The paragraphs below describes Refsnes Data's original visions (1999) about future web applications.",
      "html": "<p class=\"intro\">The paragraphs below describes Refsnes Data's original visions (1999) about future web applications.</p>"
    },
    {
      "type": "header",
      "metadata": {
        "level": "h2"
      },
      "text": "Executables Will Die, JavaScript Will Live",
      "level": "h2"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Compiled executables (compiled from languages like C or Java) cannot run on different hardware.",
      "html": "<p>Compiled executables (compiled from languages like C or Java) cannot run on \ndifferent hardware.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Executables (EXE files, ActiveX and COM objects, DLL-files) are components that prevent the development of applications that can run over the internet.",
      "html": "<p>Executables (EXE files, ActiveX and COM objects, DLL-files) are components \nthat prevent the development of applications that can \nrun over the internet.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Future application will not use, or rely on, executables or any other components installed on the client's computer.",
      "html": "<p>Future application will not use, or rely on, executables or any other components installed on the \nclient's computer.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Our suggestions:",
      "html": "<p><strong>Our suggestions:</strong></p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Write your future applications using only HTML, CSS and JavaScript.",
      "html": "<p>Write your future applications using only HTML, CSS and JavaScript.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Make sure your future applications run in any web browser.",
      "html": "<p>Make sure your future applications run in any web browser. </p>"
    },
    {
      "type": "header",
      "metadata": {
        "level": "h2"
      },
      "text": "Web Applications Will be Internet Services",
      "level": "h2"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "The history is full of large, purpose built, applications. Many of these died very quickly, because they could not survive requirements changes.",
      "html": "<p>The history is full of large, purpose built, applications. Many of these died \nvery quickly, because they could not survive requirements changes.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should be flexible, generalized, and gracefully adjust to changes, without being crumbled or destroyed.",
      "html": "<p>Applications should be flexible, generalized, and gracefully adjust to \nchanges, without being crumbled or destroyed.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should be able to scale from supporting a few to millions of requests per day.",
      "html": "<p>Applications should be able to scale from supporting a few to millions of\nrequests per day.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should be able to spread from one server to many, or to move between servers, without breaking the application.",
      "html": "<p>Applications should be able to spread from one server to\nmany, or to move between servers, without breaking the\napplication.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should be able to cooperate with other applications.",
      "html": "<p>Applications should be able to cooperate with other applications.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should not contain large masses of code.",
      "html": "<p>Applications should not contain large masses of \ncode.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should be broken down into smaller services, that are easy to create and easy to maintain.",
      "html": "<p>Applications should be broken down into smaller \nservices, that are easy to create and easy to maintain.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should be a set of Internet services that can return data to submitted Internet requests.",
      "html": "<p>Applications should be a set of Internet services\nthat can return data to submitted Internet requests.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications should request services via standard Internet protocols without maintaining a permanent connection to the server.",
      "html": "<p>\nApplications should request services via standard Internet protocols without maintaining a permanent connection to the server. </p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Our suggestions:",
      "html": "<p>\n<strong>Our suggestions:</strong></p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Write your future applications using Internet based SOA (Service Oriented Architecture).",
      "html": "<p>\nWrite your future applications using Internet based SOA \n(Service Oriented Architecture).</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Make your application services general and flexible, and ready to serve different types of requests.",
      "html": "<p>Make your application services general and flexible, and ready to \nserve different types of requests.</p>"
    },
    {
      "type": "header",
      "metadata": {
        "level": "h2"
      },
      "text": "Future Applications Will be Easy to Create and Edit",
      "level": "h2"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Clients and servers will exchange data in an easy understandable way.",
      "html": "<p>Clients and servers will exchange data in an easy understandable way.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications will not be coded, if it can be avoided.",
      "html": "<p>Applications will not be coded, if it can be avoided. </p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications will be created and modified, by editing models, not by editing code.",
      "html": "<p>Applications will be created and modified, by editing models, not by editing code.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Application descriptions will be readable by humans.",
      "html": "<p>Application descriptions will be readable by humans.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Application descriptions will be self describing.",
      "html": "<p>Application descriptions will be self describing.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Applications will be written by users, not programmers.",
      "html": "<p>Applications will be written by users, not programmers.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Our suggestions:",
      "html": "<p><strong>Our suggestions: </strong></p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Use human readable text files to describe services, and provide services by executing these descriptions.",
      "html": "<p>Use human readable text\nfiles to describe services, and \nprovide services by executing these descriptions.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Use text files (like JSON files) to describe applications.",
      "html": "<p>Use text \nfiles (like JSON files) to describe applications.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Use text files (like JSON files) to exchange data.",
      "html": "<p>Use text \nfiles (like JSON files) to exchange data.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Use HTML, CSS, and JavaScript to execute applications.",
      "html": "<p>Use HTML, CSS, and JavaScript to execute applications.</p>"
    },
    {
      "type": "header",
      "metadata": {
        "level": "h2"
      },
      "text": "Three Little Web Developers...",
      "level": "h2"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "Once upon a time there were three little web developers developing a new web site.",
      "html": "<p>Once upon a time there were three little web developers developing a new web \nsite. </p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "1. The first web developer was using AppML.",
      "html": "<p>1. The first web developer was using AppML.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "2. The second web developer was using his favorite server programming language.",
      "html": "<p>2. The second web developer was using his favorite server \nprogramming language.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "3. The third was using a professional enterprise web development framework.",
      "html": "<p>3. The third was using a \nprofessional enterprise web development framework.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "The first web developer had a demo up and running in two days. After collaboration with the users, an exiting prototype was ready in a week. And after two weeks of testing, an intelligent, fast and easy to use, web site, was ready to publish.",
      "html": "<p>The first web developer had a demo up \nand running in two days. After collaboration with the users, an exiting prototype was ready in a week. \nAnd after two \nweeks of testing, an intelligent, fast and easy to use, web site, was ready \nto publish.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "The second web developer had his web site ready after 6 months. But the WWW had changed its requirements, and was not satisfied. The web developer could not make major changes to his project because it contained too much code. So he started the development of version 2.",
      "html": "<p>The second web developer had his web site ready after 6 months. But the \nWWW had changed its requirements, and was not satisfied. The \nweb developer could \nnot make major changes to his project because it contained too much code. So he \nstarted the \ndevelopment of version 2.</p>"
    },
    {
      "type": "text",
      "metadata": {},
      "text": "The third web developer never managed to complete his work. The professional web development framework was very difficult to use, very hard to understand, and almost impossible to test.",
      "html": "<p>The third web developer never managed to complete his work. The professional web development framework was very \ndifficult to use, very hard to understand, and almost impossible to test. </p>"
    },
    {
      "type": "text",
      "metadata": {},
      "links": [
        {
          "text": "Take a look at how the first developer did it",
          "href": "https://www.w3schools.com/appml_cases.asp",
          "title": ""
        }
      ],
      "text": "Take a look at how the first developer did it .",
      "html": "<p><a href=\"appml_cases.asp\">Take a look at how the first developer did it</a>.</p>"
    }
  ]
}